/*****************************************************************************************************
*																		  ,~.
*	右边是我家哥哥，能保佑程序不出bug，千万别动，小心它来啄你--------->  ,-'__ `-,
*																	  {,-'  `. }              ,')
*																	 ,( a )   `-.__         ,',')~,
*																	<=.) (         `-.__,==' ' ' '}
*	头文件:校准YAW轴数据任务									 		  (   )                      /)
* 																	   `-'\   ,                    )
*	作者:张钧驰															   |  \        `~.        /
*																		   \   `._        \      /
*	2023-7-8																\     `._____,'    ,'
*																			 `-.             ,'
*					 															`-._     _,-'
*																					77jj'
*																				   //_||
*																				__//--'/`
*																			  ,--'/`  '
******************************************************************************************************/

#include "struct_typedef.h"



#define RTA 57.29578f


typedef struct
{ 
 const fp32 *YAW;
  fp32 yaw;
  fp32 last_yaw;
  fp32 this_yaw;
  fp32 yaw_last_err;
  fp32 yaw_err;	
  fp32 yaw_out;
fp32 expect_yaw;
 fp32 yaw_rad;
	fp32 yaw_C;
}chassis_angle_t;

void Calc_yaw_task(void const *pvParameters);



fp32 fpabs(fp32 i);




